{
    "id": "white_supremacy_newspapers_19",
    "series": "white_supremacy_newspapers",
    "lcn": "sn85038558",
    "date": "1879-03-22",
    "text": "MRS. R. A. BLUNT (colored.)\nOn the twenty-fist of September,\n1878, I was at home in Natchitoches.\nBetween II and 12 o'clock I inquired\nwhat was the matter from my lanU\nband. I saw men coming, all armed.\nThe house was surrounded by armed\npen. Mrs. Hains asked me wheth\nor I was going to leave the house.\nMy husband, after giving orders\nnot to open the door, went into the\ngarret. The crowd knocked at the\ndoor. Judge Chaplin said that only\ntour or five would go ia. He said for I\nhomanity's sake to open tbe door. I\nrefused to, and be left. The door\nwas then broken in and Mr. Canoing- I\nham pointed a pistol at my head and\nled me out of the house into the t\nstreet. Orders were then given to\nmarch the women to jail. At the re\nquest of my husband I visited him h\nand he gave me his watch and book.\nThey, the guards over Mr. Blount, i\nmade a light after I got Iate the room\nwhere he wasunder guard. Mr. Cnn\nningham said, \"Blunt I want some\nasurance from you, for the negroes\nare forming below town.\" There\nwere some men on horseback shouting\nfor \"98 if298 !\"\nWitness then explained her advicea\nto the negroes to disperse.\nIt was after 10 o'clock when I got'\nbarck to my house. I was sitting in a\nrocking-chair when I heard horses,\nand Mr. Blunt came in between two\nmen. I recognized his voice, and I\npicked up the light and went down.\nHe told me to have his horse ready at I\nonce. The naeo told him to harry op. a\nCross-examined by Mr. Luzeoburg.\nOn the twenty-grst of dIeptember the\nhouse was srrounded by a crowd. I\ndeclined to open the door and it was\nbroken open. Mr.Cunooningham held\ntihe pistol so close to me thatiff\ntoraed it would have touched me.\nI cannot identify Mr Cunoingham.t\nI know that he had a light hat with a\nbroad band. I eannot say positively\n(pointing to Mr. M. J. Cunningham)\nwhetlher it:is this gentlemen or not.\nI know that the man who pointed the i\npistol at me, and the man who re\nquested Mr. Blunt to ouse his inlluenee\nto mend out and desperse the negroes,\nwore the same hat.\nWhen I went back the seconed time\nit was aboo 8 o'clock. I went to the I\ncourt-hoase to see my husband,\nand I sent in without opposition. C\nMr. Cnnlinghanm told the guard a\nwhere to pilot me to, and I 'went at a\nthe request of Mr. Blunt to the no- a\nI could not tell whether the me-.\ngroees had any arms, for the alighbi\nwas very dark. I saw one or two I\ngnas is the party. These colored I\nmen were about thirty in the road. \"\nEeb man seemed to be a leader.\nThey said, when I went to dissuade t\nthem from coming into the town, la\nthat Mr. Blunoat was their leader, aad\nthey had a right to demand him. At- I\nte seomse talk I dissuded them. Capt. I\nJack Inatformed me that what they\nwanted was for Mr. Bluntto stick to I\nhis churcb and quit polities, Ie is a [\npastorof theelarch. I did net.a I\nany one In thde rwd of elored men a\nthat I mtaw. 1 nmnae4Jpaed, w a\nwitlhte beinlg asked, I know i _\nJack. Be Is . la , la MpXlatsu.\nI was in Natchitoclhes at Mr. Illunt's\nhouse, on the twenty-first of Septem\ntember. When Mr. Blunt came in lie\nwas very pale, and was followed by\nacrowd of men. 11ie said that the\nmen wanted to kill him, simply be.\ncause he had dared to open the lRe\npublican canlpaign. I saw Mrs. Blunt\nwhen she was returning from jail. I\nwent to go snrety for Mr. Blunt, be.\ning a real estate owner. It was about\nnine o'clock when Mrs. Blunt said\nshe was requested to go out of town'\nto the Dirt Bridge, and speak to the\ncrowd there. I, knowing Mrs. Blunt\nwas ani invalid went with her. She\ntold the colored men, there were\nabout twenty, that Mr. Blunt was in\nthe htnds of the Democrats.\nNAARY BLUNT (colored)\nwas called. The witness said that\nshe lived in N1atchitoehes. There\nwere armed men (about 2(N)) in front\nof my father's house. Mr. M. J. Cun\nningham was the captain of the mob.\nJ. T. King, James Cosgrove and Mr.\nJack were with the mob. Mr. M. H.\nCarver and Simour Curtis were there;\nMi. David Pierson also.\nI was in tile house and heard men\non the outside turning the slats to\nlook in. There was a light whisker\ned man there, and he said: \"God\nd- it; there's fourteen negroes in\nhere.\" I said : \"It'. fourteen lies.\"\nA man outside said that if iMr. Blunt\nwas an honest man lie would come out\nor let them in. I said that my fath\ner was an honest man as there was,\nand there wasn't a man, colored or\nwhite, who could coincide with him.\nSam Rains broke the door down. I\nwould not open the door even for my\ngrandfather. The crowd went into\nthe kitchen and ate everything up.\nThen they pumped all the water out\nof the cistern looking for my father\nafterward under arrest. I was taken\nto the court-house bareheaded, and,\nyoun might say, barefooted.\nCross-examined by Mr. Beckwith.\nThe first I saw of my father that day\nwas about 8 o'clock. I was part of\nthe time up stairs and part down. I\ndid not see the nine negroe men\nwhen they came in. My mother\nfastened the door. I know that, be\ncause she had the keys.\nWhen I heard the rushing on the\nstreet I was just up stairs. The men\nin the house were members of our con\ngregation. They were Jos. Jones,\nEdward Page. Harrison Baldwin,\nWm. Russell, Esau Davis. I doe't\nremember their names. Besides my\nself there was my motler and a Mr.\nLeroy in the house. I saw the crowd\nwhen It approached the house. When\nI got down stairs the men were only\non the front of the house. A man\nwho stays in our yard went to get\nover the fence to go and get his gun,\nand somebody yelled out, \"There he\ngoes.\"\nI don't think Mrs Paris was in the\nhouse when the crowd came. Before\nthe door was broken open I saw Mr.\nLevy and Mr. Cunningham outside.\nThe crow was waiting, and Mr. Levy\neame up and asked, \"What is the\nmatter ?\" and the crowd told him\nthat tie door was locked. He said\nthat he was broad enough to defy the\nUnited States, slapping his left\nshoulder. I am certain it was Col.\nLevy, because I have known him\nsince I wase child. I saw Mr. Cos\ngrove; was standing in the street,\nright in front, with a pistol drawn at\nhis side. There were a namber of\npeople between him sad I.\nSam Rains was the first man to en\nter the house, atd Joe Conningham.\nIsaw the demijohn on the floor, an4o I\nsuppose from that that tihe crowd was\nlookinog for him ino the demiajohn.\nThey went back to the cistern, which\nis underground, and pomped the\nwater, or some of it, out. I don't\nknow whether they wanted to\nGnd my father under water or not.\nThe house where I live belongs to\nme; my father never owned it. That\nday up there they carried me to the\ncourt-house under guard. I saw\nBarlow that day in front of Mr. Me.\nDaniel's store. He did not speak to\nme."
}