{
    "id": "white_supremacy_newspapers_22",
    "series": "white_supremacy_newspapers",
    "lcn": "sn90059426",
    "date": "1923-09-07",
    "text": "THE CALL of the NORTH\nis published every Friday bp the Gull of the North Publishing-Co., Si. Paul, Minnesota,\nand will stand for American institutions, principles, ideals and traditions without fear\nor favor.\nEdited, not to make up people's minds, but to shake up people’s minds; to help\nmold active public opinion which will make America a proper place to live in.\nNews of truth kills more false news and shrivels op more “bunk” than all the earnest\narguments in the world. Truth helps to clarify opinions on serious questions by serious\nPeople.\nHie CALL GF THIS NORTH will strive to give the American viewpoint on Pub\nlished articles and separate the droes from pure gold in the current news of the day.\nP. J. ORN. - * I 7 . . . - Editor In Chief\nSUnSr TTARPIBK, tv n. r I I I - Associate Editor\nADVERTISING RATES WILL BE FURNISHED UPON REQUEST ■\nSUBSCRIPTION RATE— • - - By Mail $2.00 Per Year in Advance\nSend all news items and address all inquiries to EDITOR, CALL OF THE NORTH, Post\nOffioe Box 172, St. Paul. Minnesota.\nANTI-KLAN MOBS A REVELATION\nThe Hibernians, in their convention held at Montreal where\nbooze is plentiful, denounced the Ku Klux Klan in vitriolic terms.\nLater the Knights of Columbus gathered at Montreal and also\nshot a broadside of vituperation on the Klan. I have examined\na large number of Roman Catholic publications and found hun\ndreds of abusive items centered against the Invisible Empire.\nAlso in many periodicals published for and by foreigners that\nhailed from Southern Europe were published most bitter words\nof condemnation aimed openly and directly at the wonderful\nAmerican organization known as the Knights of the Ku Klux\nKlan. It is needless to state that most of these spoken and\nwritten statements were intended to influence certain foreign,\nignorant, superstitious,* gullible, hot-blooded, un-American ele\nments in the United States. Now then, let us show you the very\nclear connection existing between the foreign propagandists, the\nhairy instigators of mob violence, the age-old enemy of Protest\nantism, the leather-eared Knights of Catastrophe, AND the oift\nrageous, murderous, dastardly attacks on peaceful, law-abiding\nAmericans, Klansmen.\nAt Steubenville (Ohio); Carnegie (Pennsylvania); Perth Am\nboy (New Jersey); and New Castle (Delaware) blood thirsty\nmobs attacked assembled Klansmen without any real provoca\ntion whatsoever. Even the most biased newspapers must admit\nthat there were no acts on the part of Klansmen at any of the\nbefore mentioned localities to justify under any American con\ndition the action of the attackers. .\nThe foreign-minded assassins and crazed fanatics partaking\nin the assaults on Klansmen had been blinded beyond all reasoji\nby the unbalanced, lying, heated, intolerant words of Hellish Hate\nwritten and spoken against the Klan. The mobbers had been\ntaught to hate the Ku Klux Klan by priests, by officials of Rom\nan Catholic societies, by non-Protestant hyphenates, by leaders\nof un-assimilable nationalities, by assinine editors such as Hap\ngood, by web-footed pettifoggers like Parker of Louisiana, by\ndemagogic politicians playing for the organized vote. . It is easy\nto accurately guage the individuals and organizations that took\nan active part, and are still actively about their satanic business,\nin the innoculation of murder-breeding poison.\nAny person, organization or publication that has advocated\nin unmistakable terms the destruction of the Ku Klux Klan is\nguilty of murder—the assassination of Tom Abbott, American\nand Klansman. It is alleged that one Paddy McDermott of Car\nnegie, a rattle-brained Irishman, fired the shot that killed Ab\nbott, but let it be said here and now that statements against the\nKlan —which incited the clay-piper to the doing of the terrible\nact contributed directly to the execution of the deed—cold-blood\ned murder. At the doors of those standing in the background\nurging mob action I lay the responsibility for the killing and\nmaiming of Klansmen. They are most guilty, yes, more guilty\nthan the ignorant, green-blooded and wop-eyed individuals mak\ning up the un-American, anti-Klan mobs.\nCareful observers studied the make-up of the anti-Klan\nmobs and found them to be composed of foreigners from south\nern Europe and Irish-Americans. A “white-mule” guzzler has\nbrains enough to know that these people are NOT Protestants.\nWhen you know that nearly all the oral and written condemna\ntions concentrated against the Ku Klux Klan come from Roman\nCatholic sources, AND when you know that the anti-Klan mobs\nare composed nearly entirely of men who are anti-Protestant, it\nis very easy to make a true connection between the instigators of\nlawlessness and the perpetrators of lawlessness.\nIf the oral and written attacks on the Klan showed merely\ndifferences of opinion, I would have little to say. But, when\nthe anti-Klan agitators cry for the destruction of the Invisible\nEmpire the complexion of the whole matter is of serious import.\nThe advocates of sabotage and mob violence must be dealt with\nfearlessly by the courts of America. When foreignism runs with\nsuch a high hand in this country that real, honest-to-God Ameri\ncans cannot assemble and go about their peaceful and lawful bus\niness without being attacked and brutally beaten, clubbed, stoned\nand shot, yes, murdered, conditions have grown in America that\nmenaces out national solidarity. Every red-blooded American\nmust take a stand with the Klan for the right of assemblage\nwithout the dangers of mob attacks. Some person said to me the\nother day that the Ku Klux Klan was indirectly the cause of the\nriots in the east, because if they (Klansmen) had not held their\nmeetings there would have been no mob-activities. That view\nof the matter gave me a clearer understanding of how grave the\nsituation really is. If the Ku Klux Klan can be mobbed out of\nexistance the very perverse forces that are back of the anti-\nKlan violence would, flushed with success, turn on other Protest\nant organizations and re-enact their programs of terrorism. Let\nall Protestants thank God that the Klan is no longer In swaddling\nclothes. The great American organization grows stronger under\nevery blow delivered against it. Jehovah protected the Ku Klux\nKlan when it was an infant so that the scaly hands of Herods\nmight not strangle the child, and now the adult has strength,\nwith God’s help, to fight effectively for America and Protestant\nism. lam convinced that a Higher Power than any earth-born\npower has made possible the marvelous growth of the Invisible\nEmpire. All Americans can say with that venerable lady of\nSoutheastern Minnesota, “Thank God, the Klan has come.”\nThe Ku Klux Klan did not cause the riots of Steubenville,\nCarnegie, Perth Amboy and New Castle, but the Klan did reveal\nto the people of the United States the claw-filled paws of foreign\nism which seek to tear out the heart of America that the raven\nous Beast might devour it. Over the entire nation we hear the\ncheers of Americans shouting, “Long live the Ku Klux Klan.”\nRapidly a realization is spreading that awakens the lovers of the\nUnited States to this fact: if the Ku Klux Klan had not come when\nit did, the glory of America would have been destroyed and buried\nin the ashes of the ages."
}