{
    "id": "white_supremacy_newspapers_15",
    "series": "white_supremacy_newspapers",
    "lcn": "sn82014546",
    "date": "1910-04-21",
    "text": "B\nILL HOWARD has been assiduously\npulling at the public teat, continu\nously, for twenty-two years!\nYes, Sir, that’s the record. Wil\nliam Marcellus is hard to wean. He\nwants more. How much more, he\nfails to state.\nHe was Solicitor.-General from 1888 to\n1896; and he stepped from that office to a\nhigher one, by merely changing cars. He\ndid not even have to wait for a train. Passed\nright from the Solicitorship to Congress,\nwithout losing a day’s pay.\nThink of fingering Uncle Sam’s long green\nwashers for twenty-two years, without in\nterruption ! Things come easy to some folks,\ndon’t they?\nHow pleasant life was to William Marcel\nlus and family! So far as I know, his fam\nily consists of Mrs. Howard’s kinspeople.\nHis own parents died before he went to Con\ngress, I think.\nBut there was Dr. King, Bill’s father-in-\nlaw, berthed year in and year out, in the At\nlanta Revenue Office, where he worked as the\nimmediate underling of a negro boss. Don’t\nyou think that, if you had been drawing\nfrom SIO,OOO to $15,000 a term, for an aver\nage of about nine months'* work, you would\nhave had more family pride and self-respect\nthan to let your father-in-law act as virtually\nthe private secretary of an insolent negro?\nMOULD YOU MANT YOUR MIFE'S\nOLD FATHER TO HAVE A NEGRO\nMAA FOR HIS BOSS? No! you wouldn’t.\nA certain white man, indorsed by Senator\nClay and many other prominent men, tried to\nget that negro’s place, and wrote to Bill,\noffering to retain his father-in-law in the\nsame place he now holds, if Bill would help\nhim get the negro’s job.\nWhat do you suppose was Bill’s reply?\nBill told the said white applicant for the\nnegro’s place, that “a bird in the hand is\nworth two in the bush”!\nThis shows how determined Bill was that\nthe negro should not be removed. It also\nshows why Rucker held the. job for thirteen\nyears.\nIt also proves that every one knew that\nBill would regard a fight on the negro,\nRucker, as a fight on himself.\nAnd it likewise proves what moral cowards\nthe Georgia delegation, as a whole, have been.\nPlague take their times! They ought to\nbe ashamed of themselves-;\nI never knew of the facts in the case, until\na few weeks ago. An Atlanta negro wrote\nto me, and put me “on”. I guess my in\nformant hates Rucker, and doesn’t love How\nard.\nBe that as it may, as soon as the facts came\nto me, I resolved there and then, that you\nshould know about it.\nRucker has been kept over us, high in au\nthority, for all these years, for no other rea\nson than that Bill Howard wanted a member\nof his family fed out of the public crib. It\nis a disgrace to him; and also to every mem\nber of the Georgia delegation who, knowing\nthe facts, kept silence!\nWe will put each member of the delegation\non the witness stand, later on. As many of\nthem as knew the inwardness of the matter,\nARE PARTIES TO THE CRIME.\nFor it was a political crime, against the\nwhites of Georgia, to let that shameful state\nof things exist, for so many years, without\nany effort to put an end to it.\nAs Bill imported his brother-in-law into\nhis District from Fulton county, and has fed\nhim out of the public crib, also, Uncle Sam\nhas certainly been an Easy Mark for Bill's\nfamily.\nNow, when I got after William Marcellus\nabout this, and about his rotten Desertion to\nthe enemy, what DO you imagine he could\nsay ? It took him two weeks to say anything;\nbut when he finally pleaded to the indict-"
}