{
    "id": "white_supremacy_newspapers_14",
    "series": "white_supremacy_newspapers",
    "lcn": "sn82014546",
    "date": "1910-04-14",
    "text": "man, who refused to even notify me of my nomi\nnation; pursued by storms of villification, wherev\ner I went; repulsed by the Bryan managers in\nGeorgia, who denied me any recognition whatever\non the Bryan electoral ticket, I came home and\ntook my bed, in utter exhaustion and despair. So\ninfuriated were my local friends at Bryan’s treat\nment of me, that McDuffie county went for Mc-\nKinley!\nOF COURSE, every one of the 27 electors who\nvoted for me, voted for Bryan, too.\n* * * *\nWhen Bryan and I were on our way to his\nhome, in 1904, I said: “Bryan, there is one thing\nthat I would like to ask you.’’ “All right; what\nis it?” he said.\n“Why was it that you would not join me, in\n1896, in the effort to line-up the Mid-Road Pops,\nand thus elect you?”\n“The Southern Democrats wouldn’t let me—”\nwas his prompt, unqualified answer.\nHe added:\n“They told me that it was more important to\nthem to control the local situation than to win\nthe Presidency.”\nIs it not amazing that Bill Howard should in\ndict me for the defeat of Bryan? Is it not almost\nincredible that he throw himself against the\nbarbed wire fence of unassailable facts, as he has\ndone?\nBill, bye-gone associations have a wonderful in\nfluence on me; and we were friends in the old\ndays on the Northern circuit, and before you had\nsoiled your manhood with close affiliation with\nJim Smith, the Convict King. When your first\nletter came, a glance showed that the task of an\nswering would be disagreeable. I let one issue of\nmy paper go by, postponing the unpleasant task,\nas it is human nature to do. But when the next\nweek’s paper was being made up, I felt that your\nletter must have a reply; and I then fished it out\nof the pile on the table, and read it, carefully.\nWhen the line was reached, in which you branded\nmy statements as “mean, malicious lies”, I turned\nto my Secretary and dictated the reply.\nIn the meantime, you had got the impression\nthat my failure to promptly publish your letter\nwas due to fear. You commented on the matter\nin Washington; and said you intended to send a\ncopy of your fear-inspiring epistle to the Atlanta\nJournal.\nMy reply to you was already in our Atlanta\noffice; and when I heard of your Washington\nblustering, a copy was furnished the Constitution.\nThus your mistake, as to your former friend,\ncaused the daily and tri-weekly Constitution, as\nwell as the weekly Jeffersonian to carry through\nout the country simultaneously an article which\ncould not have done you any good.\nIt seems to be a law of fate that one false step\nleads to another: you will find that your second\nletter is as much of a mistake as your first.\n(1) Your acrimonious arraignment of me, for\nhaving been a Populist, will turn against you\nevery old Pop who has been keeping you in clover.\nThey may not be as intellectual and accomplished\nas you, Bill, but their hard common sense will\ntell them that so much bad-tempered vitupera\ntion of me, was not legitimately a part of your\ndefense of your public record. Their mother wit\nwill teach them that you do not —by proving me\nto be a murderer, a thief, a traitor, a scoundrel\ngenerally— establish your right to another term\nin Congress.\nIf your political crime, last spring, aided the\nRepublicans to put this infamous tariff law on us,\nyou are gone, Bill—no matter how black you may\npaint Watson’s record. The* record of Watson is\nnot the issue which your District is empanelled\nto try. It is your record, Bill, tfot upon what\nWatson has done or may do depends your fate,\nMr. Mudslinger. Every tub must rest on its own\nbottom in these Congressional races; and none of\nthese newspaper clipping Members can expect to\nwin another term by so easy a trick as the con\ncerted abuse of Watson.\n(2) You inquire the' reason why I did not\nspeak sooner of how Rucker kept himself in office\nby using your father-in-law as a screen. Didn’t\nknow the facts, Bill—or you’d have heard my\nwar-whoop long ago.\nI had thought it rather strange that none of our\nCongressmen made a fight on Rucker, similar to\nthose which Tillman made on Dr. Crum. But it\nwas not until a few days previous to the writing\nof the little editorial which aroused your ire, that\na negro man, of Atlanta, wrote me, and told me\nyour secret.\nThe moment I learned how that cunning coon,\nRucker, had used yoqr father-in-law, all these\nShe ‘Jeffersonian\nyears, to keep himself at the head of the Revenue\nService in Georgia, I determined to attack you,\nBill.\nAnd, after reading your scathing denunciation\nof me, the people will understand why our Sena\ntors and Representatives made no fight on that\ncunning coon.\nThey knew what was in Bill Howard, just as 1\ndid, and they did uot want to enrage that rattle\nsnake.\nBill, you did not tell the truth about Rucker.\nHe holds his office at the pleasure of the Presi\ndent, and could have been removed any time dur\ning the last thirteen years. Why didn’t you have\na white placed, Bill? The question is a fair one —\nanswer it.\n(3) You virtually announce that the whole\nGeorgia delegation has combined to make war\nupon the red-headed Insurgent. All right: let\n’em come. It will not be any very glorious feat\nto hold the fort against the entire collection.\nSo, by all means, “On with the dance.” It is\nabout time that it was breaking loose in Georgia,\nagain, anyway.\n(4) Where do I get my campaign funds?\nOut of the McDuffie Bank, where I keep and re\ntain and occasionally replenish a nice little bank\naccount.\nWhere do you get yours, Bill?\nEver fingered any of Jim Smith’s coin? Ex\npect to get the benefit of some of it, this year?\nYou'll need it, Bill, and you can have as much\nof it as you demand.\nWhy do 1 say that?\nIn the first place, there is a persistent rumor\nthat there is a political partnership composed of\nJim Smith, Hampy McWhorter, and your virtuous\nself. Consequently, and on general principles and\naccording to law and immemorial custom your\nworthy partner will “come across”.\nIn the second place, you made some noble\nspeeches for him when he ran for Governor in\neight counties— two of which he carried by great\nly increasing per capita circulation therein.\nThirdly, your powerful pull with the Republi\ncan administration shielded liim in the peonage\nbusiness. I used to hear that you and Hampy,\nwhen you were Solicitor and Hampy was Judge,\nused to run the court, up there, in the interest of\nJim Smith’s convict farm. That may have been\nthe time when Jim and Hampy were earning hon\nest pennies by shipping “Tea Culture” tomes, back\nand forth, on that little Jim Smith railroad. But\nalthough I often heard the rumor, I paid no par\nticular attention to it —shining names being so\nfrequently the targets of mere envy.\nBut, lately, there has been something more\ndefinite, as I learn for the first time, from a com\nmunication made to me March 9, 1910.\nIs it a fact, Bill, that you struck down an old\nex-Confederate soldier, at the behest of Jim\nSmith? Is it true that Judge E. C. Kinnebrew,\nof Athens, had issued two or three warrants\nagainst Jim Smith, for peonage, and that you\ncaused him to be virtually removed from his office\nas United States Commissioner?\nThat brave old soldier had held his position\nseveral years, hadn’t he, Bill?\nTo humiliate the heroic veteran You and Hampy\nand Jim Smith made use of the Federal Judge,\nW. T. Newman, didn’t you, Bill?\nSince the new appointee went into office, there\nhave been no more warrants out against Jim\nSmith —eh, Bill?\nThe new man is an absolute tool of Jim Smith,\nand was appointed for that reason, —is it not so,\nBill?\nAh, you pussy-footed worker behind the scenes!\nNo wonder your colleagues were afraid to offend\nyou, by attacking the negro who kept your fath\ner-in-law in the clover field!\nYou imported your brother-in-law from Atlan\nta, into your District, and gave him the position\nof Secretary to yourself, didn’t you, Bill? How\nmuch has he cost the country? Why didn’t you\ngive that good job to some ambitious young man,\nof your own District? The other Congressmen\ndo it. Why go out of your District to fill a place\nthat belongs to your District?\nSuppose one of our Senators should import an\nAlabama youth to be his Secretary, wouldn’t\nGeorgia set up a howl? Certainly. But youi*\nspurning of your own District and going to an\nother for a Secretary is just as much of an affront\nto your constituents.\n(5) You ask why I accepted the nomination of\nthe Populists, in 1908, which nomination, as you\ndo not seem to know, was made at a regular na\ntional convention held in St. Louis.\nIt affords me the utmost satisfaction to tell\nyou, Bill. But I must ask you to go with me, for\na short stroll into the past.\nWhen the Farmers’ Alliance was sweeping the\ncountry, and Lon Livingston was making Patri\notic Fuss all over the country, you regulation\nDemocrats leaned up against Old Man Peepul like\na sick kitten to a warm brick. With the excep\ntion of the Sub-Treasury, you vowed and declared\nthat Old Man Peepul could get everything he\nwanted inside the Democratic party. Since when\nhave you read the Democratic platforms of those\ndays, Bill?\nThey were almost as much like the Populist\nplatforms as buzzards are to turkey-buzzards, or\ndoves are to turtle-doves, or quadrupeds, to four\nfooted animals.\nAnd that national Democratic platform of\n1896, which you speak so flatteringly of, was\nmade for the especial purpose of catcliing Popu\nlist votes. To show how much sincerity there\nwas in it, the men who made it, nominated on it\na man from Maine (Sewall) who was dead against\neverything in it, excepting the Silver plank.\nAnd poor, distraught, self-entangled Bill How\nard represents me as fiercely opposing that Popu\nlist platform, when I was one of the two Vice-\nPresidential candidates who ran with the Peerless\non it.\nLest you should think that Bill’s astounding\nerror is nothing more than a forgetfulness of\ndates, I call your attention especially to his argu\nment on the 27 electoral votes which he says I\ngot.\nI never have received a single electoral vote as\ncandidate for the Presidency. Those 27 electoral\nvotes were given for me as candidate for Vice-\nPresident, on the Bryan ticket of 1896, Sewall\ngot all the others.\nThose 27 electoral votes were for Bryan for\nPresident.\n(There were no McKinley and Watson electors\nin the field.)\nIt was Bryan and Sewall, Bryan and Watson\nand McKinley and Hobart, Bill.\nBut coming back to the main line of thought—\nafter the Populist movement had been engulfed\nby the Fusion deal of 1896 (and I had opposed\nit, because I foresaw the result) the Democratie\nleaders were out of danger, and they began to as\nsuage their zeal for Populist principles.\nThey gradually became their old selves again.\nSo much so, indeed, that in 1904, they bought\nthe nomination of Parker, and got their important\nplatform plank by telegraph, and from New\nYork. It was the Gold Standard plank, of course.\nAnd Bryan lost a second chance at the White\nHouse, by not walking out of the convention and\nmaking a direct appeal to the people.\nI made a general canvass of the country as\nPresidential candidate —why? Because, I thought\nsomebody ought to represent the people. Parker\nand Roosevelt were both Wall Street candidates,\nas Bryan himself had said. My hope was to get\nthe Free Silver vote, which was 6,000,000 strong.\nCould I have done this, there was a chance to\nwin. Populists and Free Silverites constituted a\nmajority. There was no reason whatever why I\nmight not have received more votes than either\nParker or Roosevelt— who were dividing the Gold\nStandard vote.\nWhat prevented my getting the Free Silver\nvote, and beating Roosevelt? The conduct of Mr.\nBryan. As he could not get the Free Silver votes\nhimself, he was determined that I shouldn’t.\nHe got on Belmont’s “Special”, toured the coun\ntry in barn-storming style, and lined up his fol\nlowing for the candidate whom he had denounced.\nThis destroyed my chances; and thousands of\nDemocrats went to Roosevelt, rather than sup\nport Parker, or throw their votes away on me.\nThat’s the solemn, indubitable truth. It was\nBryan’s short-sighted policy that elected the Re\npublican ticket. It is Bryan’s lack of political sa\ngacity and statesmanly breadth of view that has\nkept the West and the South divided. It is\nBryan’s instability and opportunism that has\nwrecked the Democratic party.\nNow we come to 1908.\nAt the time I decided to make an active can\nvass, confined chiefly to Georgia, there were two\ncontrolling reasons:\n(1) It had become evident to my mind that,\nwith slender resources and lack of organization,\nthe more I concentrated, the better.\n(2) Bryan’s social equality record (which I\nhad recently learned) and the way in which the\nSouth had been treated at the Denver Conven\ntion —where the Georgia delegation had been out-\ncontinued on Page Fourteen)\nPAGE ELEVEN"
}