{
    "id": "white_supremacy_newspapers_17",
    "series": "white_supremacy_newspapers",
    "lcn": "sn82014546",
    "date": "1910-04-28",
    "text": "IN THE HAND IS WORTH TWO IN\nTHE BUSH.\"\nThat motto kept the cunning coon, Rucker,\nin office, us, for thirteen years; and it is\nkeeping (he incompetent and' perhaps, cor\nrupt Carter Tate in office, too.\nThe more you learn of Bill Howard's rec\nord. the more you know about him, don't you?\nHe had the audacity to ask me where was\nthe man who. trusting to my honor, had not\nbeen betrayed?\nAnd, here he has been, for fourteen years,\nLEADING A DOUBLE LIFE. PRE\nTENDING TO BE A WHITE MAN AND\nA GENTLEMAN!\nWe now discover this dark-skinned, secre\ntive. cat-like half-Spaniard- to have been a\npersistent traitor to the whites, a cloaker of\ncrime, a base deserter to the Republicans. His\ndeliberate apostacy is costing the common\npeople at least a million dollars a day, in the\nincreased cost of living.\nAnd to cap the climax of his infamy, he is\nadvertised to leave his post of duty, io come\nhome and make speeches to save himself\nfrom, merited punishment! -HOW MANY\nSPEECHES HAS HE EVER MADE IN\nCONGRESS FOR THE PEOPLE? None.\nHe might as well have been born dumb.\nWhat bad law has he tried to repeal ? None.\nWhat good law has he tried to enact? None.\nFor the Pullman Palace-car Company, for\nthe Telegraph Companies, and for the Ex\npress Companies he strenuously worked and\nvoted, to keep these cormorants from being\nput under the supervision of the Interstate\nCommerce Commission.\nWhy? ASK HIM THE QUESTION,\nAND DEMAND A REPLY!\nIsn't he sending telegrams all over his dis\ntrict, now? Yes; he is. Does he pay for\nthem? No; he doesn’t. The Company allows\nhim to send them free. Why? BECAUSE\nHE SERVED THE CORPORATION SO\nWELL.\nI guess he uses the Express Companies and\nthe Pullman cars, the same way.\nPaid $15,000 for nine months’ work, every\ntwo years; getting big fees in law cases; his\nfather-in-law working under a nigger and\ndrawing good pay; his brother-in-law pock\neting $1,500 a year as Bill’s Secretary; the\nGovernment allowing him ten cents a mile to\nand from Congress; don’t you think— Oh,\ndon't you think! he might have been honest\nand straight enough to vote with the people\nand not with the Pullmans, the Telegraph\n• and the Express Companies?\nAnd don’t you think— OH, DON'T YOU\nTHINK! that his heart might have been true\nenough to the South— which has honored\nhim— NOT TO BETRAY HER TO NEW\nENGLAND ROBBERS?"
}