{
    "id": "white_supremacy_newspapers_13",
    "series": "white_supremacy_newspapers",
    "lcn": "sn82014546",
    "date": "1910-03-03",
    "text": "Revise Court Procedure, Urges\nThos. E. Watson\n(concluded from page thirteen)\nas far as he goes. But he did not follow the\nsubject to its logical conclusion. The right to\nkeep firearms in the dwelling should never\nbe infringed. The owning of revolvers ’and\nrepeating rifles, however, should be licensed,\nand the carrying of weapons, concealed or\notherwise, should be carefully regulated.\nViolations of such regulations should be pun\nished as felonies.\n(4) Negro secret societies must be taken\nin hand. The South Georgia negro who way\nlaid. and killed a white man, some time ago,\ndeclared on his way to death that he owed\nhis ruin to the secret society. There's where\nmost of the deviltry is brewed. These socie\nties should be required to take out a license;\nthe ordinary and sheriff should have the\nright of visitation; none but strictly charita\nble organizations should be allowed; and\nthese should be stamped out, on proof of\nspeeches and actions inflaming the blacks\nagainst the whites, or counseling boycotts of\nwhite employers.\n(5) There should be a mounted policeman\non every public road., day and night, until we\nget better conditions. Every strolling negro\nand white man should be halted and made to\ngive an account of himself. If he is O. K. he\ncan easily do it. If he is not O. K. he is a\nwalking menace to the community and ought\nto be treated penally as a vagrant. The idle,\ninsolent and criminal negro bucks of the\ntowns and cities ought to have the same med\nicine.\nIt would cost some money — possibly as\nmuch as the Laymen s meetings are demand\ning for the heathen.\nBeing one of the cranks who are more\ndeeply concerned for the future of their own\npeople than they they are for the Japs, and\nthe Chinks, and the Hindus, and the Congo\nniggers, I don’t mind saying that if it did\ncost us as much to protect our women and our\nhomes as it does to mantain charity hospit\nals, dispensaries, doctors, dentists, surgeons,\nschools, etc., in heathendom—the money\nwould be well spent. Thos. E. Watson.\nThomson, Ga., February 14.1910.\nWhy the Georgia Delegation Made\nNo Fight on the Negro, Rucker\nFor thirteen years, Henry Rucker has been\nat the head of the Internal Revenue Depart\nment in Georgia. For thirteen years, this\nsassy negro has drawn the fat salary of\n$2,750 per annum.\nHave the Democratic Congressmen from\nGeorgia made any concerted and determined\neffort to oust Rucker? Have they insisted,\nAND KEPT ON INSISTING, that a white\nman should have that office?\nNo: they have not. Had they fought\nPucker, as Senator Ben Tillman fought Dr.\nCrum, (the Charleston negro,) Rucker would\nbe out of that high position, just as Crum is\nout of the Charleston custom house.\nWhy have the Senators and Representa\ntives from Georgia submitted so quietly to\nthis humiliating state of affairs?\nI will tell you. Rucker has held his place\nmainly because Congressman Bill Howard's\nfather-in-law holds the next highest place in\nthe service. Dr. King, the white man,\nWORKS UNDER RUCKER. THE NE\nGRO, and gets SI,BOO per year. This he has\ndone, for the last ten years.\nWith Bill Howard’s father-in-law snugly\nberthed in the Collector’s office, and Lon Liv\ningston’s grandson nicely cared for in the\nPostoffice, you can begin to see some of the\nloveliness of “a working arrangement” be\ntween officials called “Democrats” and those\ntagged “Republicans”.\nYou tickle me, and I’ll tickle you—’tis an\nancient game.\nGlje Jeffersonian\nGo and Write Your Name in the\nVoters’ Book\nIf, by April sth, you shall not have written\nyour name in the voters’ book, kept by the\nTax Collector, you will have lost your right\nto take part in any primary or election of\nthis year.\nThe new law is a premeditated scheme to\ndisfranchise two classes:\n(1) The country voters.\n(2) The poor men.\nIt is meant to do what those New Rules of\n1908 had in view, towit: the concentration of\npower in the towns and cities.\nThere is the gravest danger that this in\nfernally contrived registration law will place\nthe State in the power of the city politicians.\nWAKE UP COUNTRYMEN!\nDon’t lose a day: go and write your own\nname in the book."
}