{
    "id": "white_supremacy_newspapers_38",
    "series": "white_supremacy_newspapers",
    "lcn": "sn85038558",
    "date": "1876-08-26",
    "text": "This individual has invited Gen.\nFrank Nicholls to canvass the State, pi\nand to a general discussion of the po- w\nlitical issues of the day, with him. lt\nGqn. Nicholls will no doubt Oeercise I\nhis own opinion in accepting or de- k\nclining this invitation ; with that we w\nhave nothing to do ; but. In the selec- S\ntion of parishes for such discussion 11\nwe earnest;y entreat that Natchito- it\nches shall be left out. a\nGen. Nicholls has every welcome to at\ncome here, and at any time he chooses\nto do so we will accord him an en- p\nthusiastic reception ; but if it is with it\nthis fellow, Packard, we must decline\nfurnishing an audience. E\nli 1874, on the 20th day of October, a\nif we mistake not, one Stockton rode m\ninto our quiet little city at the head a\nof a body of United States cavalry si\nand proceeded to arrest a number of C\ncitizens without warrant of law, and\nto harry our leading people, drive a\nthem to the woods, Insult women and p\nchildren and outrage law and liberty\ngenerally.\nThe citizens of this parish have not o\nyet forgotten that. The arrested par\nties are still alive and cherish the\nhope that an hour will come to make c\nall thinogevbn with the prime instig\nator and head of these outrages, S.\nB. Packard, and this is our reason for\ndeclining in advance the honor (f) of\na social visit of this damnable fiend.\nIf he comnes, let him come as all rad\nicals do, as an alien and an outlaw a\nto society. Let him sneak into the\nparish like a car, and out the same a\nway.\nWe have no audiences, no greet\ning for Packar and his crew. We t\nknow what they are, and what they\nwill do when in power. As soon would I'\nwe invite Mat. Wells or Tom Ander\nson to our midst, as this head centre\nof all the villainy, murder and out\nSrages that have been perpetratefin I\nour parish for the past eight years.\nNo, no ! We are not yet prepared\nwith sufficient christian fortitude to\nsubmit to this degradation; es\nI tending hospitality o the man\ne who has invaded every right we pos\n. sees; who broke down our social bar- 1\nriers, dragged our eitizdhs into ear\nalry camps,.insulted our women under\n0 our own roofs and who has made him.\ne self an outlaw to all feelings of kind\nII ness and hospitality."
}